employee_salary_dataset.csv

In [5]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/gvasilakop/BBDA_Project_1/refs/heads/data_extraction/employee_salary_dataset.csv")
df.head()

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450